import React from 'react'
import './history.scss'
import history from '../../../image/history.png'


export const History = () =>{

    return(
       <div className = 'history'>
       
       <div className = 'historyWrap'>
       <div style = {{textAlign: 'center'}}>
           <h2>История Hyundai Santa Fe</h2>
       </div>


       <div className = 'historyContent'>
       
       <div className = 'historyContentImg'>
           <img src = {history} alt = 'history'/>
       </div>

       <div className = 'historyContentTxt'>
       <p><span>1 поколение (2000 - 2007) </span>
       В первый год производства, Santa Fe был предложен двумя двигателями с соответствующей трансмиссией. В Северной Америке, экономичный, хотя с недостаточной мощностью, четырёхцилиндровый двигатель объёмом 2,4 л становится стандартом и мог комплектоваться либо с 5-ступенчатой механической или 4-ступенчатой автоматической коробкой передач. Двигатель 2656 CC (2,656 л) Delta V6 предлагал больше мощности, чем двигатель с четырьмя цилиндрами, но был доступен только с автоматической коробкой передач. Передний привод шел в стандартной комплектации (с системой traction control опцией для двигателя V6), полный привод по выбору. Двигатель Common-Rail Turbo Diesel (CRTD) объёмом 2 литра был предложен за пределами Соединенных Штатов. В Австралии Santa Fe поступил в продажу в ноябре 2000 года только в одной комплектации: двигателем 2,7 л V6 соединенным с четырёхступенчатой полуавтоматической коробкой передач. Полный привод был стандартом. Дешевые 2,4 л четырёхцилиндровые двигатели появились несколько месяцев спустя, в 2001 году, но были доступны только с механической коробкой передач. Наряду с аналогичными Ford Escape и Mazda Tribute, Santa Fe был также первым компактным кроссовером с двигателем V6.На автомобиле постоянный полный привод с несимметричным межосевым дифференциалом, который делит крутящий момент между передними и задними колесами в пропорции 60:40. Кроме того, дифференциал самоблокирующийся — пробуксовку прекращает встроенная в него вискомуфта. За дополнительную плату на корейских версиях устанавливался задний межколесный дифференциал повышенного трения.
       </p>

       <p><span>2 поколение (2008 - 2010) </span>
       Следующее поколение Santa Fe дебютировало в 2006 году на Североамериканском международном автошоу. Первый серийный Santa Fe сошел с конвейера Hyundai в городе Монтгомери, штат Алабама 18 апреля 2006 года. Он разделяет сборочную линию с текущим поколением Hyundai Sonata. Новое поколение избавляется от причудливого дизайна старого стиля в пользу более современного вида.

В Соединённых Штатах новые поколения предлагались в GLS, SE, а также «Limited» версиях. Новый Santa Fe возвращается ручная коробка передач, но только с двигателем 2656 CC (2,656 л) V6. Двигатель 3342 CC (3,342 л) V6 (такая версия того же двигателя может быть обнаружена в Hyundai Sonata) входит в стандартную комплектацию SE и Limited и поставляется только с 5-ступенчатой автоматической коробкой передач. Обе модели с 2WD и AWD с двигателем 3,3 л имеют расход топлива от 12 л/100 км в городе и 9,8 л/100 км по шоссе. Дизельный двигатель объёмом 2,2 л (недоступен в США) с 186 л. с. имеет расход в смешанном цикле из 7,2 л и в городском цикле 8,0 л Полный привод Borg-Warner Torque Management, передающий момент на колеса имеющие лучшее сцепление с дорогой. Если передние колеса немного пробуксовывают, то задняя ось будет крутиться быстрее на 10 %. Если передние колеса начинают скользить много и/или переключатель traction control установлен на максимальную сумму крутящего момента (например, 50 %), то крутящий момент пойдет на заднюю ось. Крен кузова в поворотах, проблема предыдущего поколения, была убрана в новом Santa Fe. Так же был уменьшен шум от дороги и ветра.

Электронный контроль стабильности (ESC), боковые подушки безопасности для всех рядов сидений, контроль давления в шинах, активные подголовники передних, а также антиблокировочная система тормозов (ABS) идут в стандартной комплектации. Имеется подогрев передних стеклоочистителей, что помогает растапливать образующийся лед в областях с холодным климатом. Некоторые функции, такие как поворот стекла задней двери и облицовка нижней части кузова не были встроены в новые модели.

Интерьер был обновлен панелью управления с голубой подсветкой (в отличие от зелёного цвета, используемых в других моделей Hyundai), освещением подстаканника и качественной кожи на версии Limited. Подголовники на задних сиденьях вызывали проблемы видимости в предыдущей модели из-за своих размеров. Новая форма подголовника в форме «гальки» позволяет сидеть на одном уровне с верхней частью сидения и не закрывает обзор сзади. Центральное заднее сиденье теперь поставляется с собственным подголовником и трехточечным встроенным ремнем безопасности. Держатели детского сидения так же входят в стандартную комплектацию.

Цены остаются конкурентоспособными, несмотря на увеличивающиеся по размерам и содержанию функции.

В Малайзии, Hyundai Santa Fe доступна как Inokom Santa Fe. Inokom Santa Fe доступна только в CRDi 2,2-литровый турбодизель и 2,7-литровый бензиновый V6.

Силовой агрегат Hyundai Santa Fe размещен спереди поперечно. При движении по ровной сухой дороге с постоянной скоростью весь крутящий момент передается на передние колеса. При проскальзывании одного из них часть тяги (до 50 %) начинает передаваться и на задний мост. За этот процесс отвечает многодисковая фрикционная муфта, управляемая электроникой.

Водитель имеет возможность принудительного изменения распределения тяги в трансмиссии: на центральной панели слева от рулевой колонки размещена кнопка блокировки муфты — 4WD Lock.

Ещё одним способом повышения свойств автомобиля на бездорожье является возможность отключения системы динамического контроля курсовой устойчивости: клавиша ESP off размещена рядом с кнопкой 4WD Lock.

Между колёсами обеих осей крутящий момент распределяют простые симметричные (конические) дифференциалы. Наличествует система имитации блокировки дифференциалов путём работы тормозных механизмов. При проскальзывании одного из колес оси и достижении определенной разницы между угловыми скоростями забегающее колесо подтормаживается.
       </p>


    <p><span>3 поколение (2010 - 2018) </span></p>
       
    На автошоу в Нью-Йорке 2012 году было показано 3-е поколение кроссовера.

Доступно 2 варианта:

5-местный Santa Fe Sport, двигатели 2,4 л и 2,0 л турбированный
7-местный Santa Fe с увеличенной колёсной базой (заменит ix55), двигатель 3,3 л.
В продажу автомобили поступили к середине 2012 года.
       
       <p><span>4 поколение ( с 2018 года ) </span>
       Впервые показан в 2018 году в феврале в Южной Корее в городе Коян. Новый Santa Fe стал на 80 мм длиннее и на 10 мм шире, а колесная база выше на 65 мм.
Два варианта исполнения:
Базовый – Theta-II 2.4GDI объёмом 2,4 л., 188 л. с.
Дизельный - R2.2 CRDi VGT на 2,2 литра с 200 л. с.
Все версии оснащаются 8-ступенчатым автоматом, а также появилась новая система полного привода HTRAC. Кроссовер, как и прежде, имеет постоянный передний привод, а муфта подключения задних колес теперь полностью электрическая. Добавлен электроусилитель руля, расположенный на реечном механизме. Автомобиль получил первую в мире систему, которая напомнит водителю при покидании салона о «забытых» пассажирах на заднем сиденье.
       </p>
       </div>

       
       </div>
       
       
       </div>
       
       
       
       </div>
    )
}